Revit 2027 API
FamilyManager.Set(FamilyParameter, String) Method
Set the string value of a family parameter of the current family type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Set(
	FamilyParameter familyParameter,
	string value
)
Public Sub Set (
	familyParameter As FamilyParameter,
	value As String
)
public:
void Set(
	FamilyParameter^ familyParameter,
	String^ value
)
member Set :
        familyParameter : FamilyParameter *
        value : string -> unit
Parameters
familyParameter FamilyParameter
A family parameter of the current type.
value String
The new value for family parameter.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid family parameter.
ArgumentOutOfRangeException |  Thrown when the input argument-"familyParameter"-is out of range.
InvalidOperationException |  Thrown when the family parameter is determined by formula, or the current family type is invalid.
See Also
Reference
FamilyManager Class
Set Overload
Autodesk.Revit.DB Namespace